---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.DoubleWallMaterialArea
source: html/f71c703e-3efb-80a8-9275-c8dd49738af1.htm
---
# Autodesk.Revit.DB.FabricationPart.DoubleWallMaterialArea Property

The double wall material area of the fabrication part. If the fabrication part is not double walled, returns zero.

## Syntax (C#)
```csharp
public double DoubleWallMaterialArea { get; }
```